[ ["flaming", "To produce flames; to burn with a flame or blaze."], ["screenshot", "An image of computer or smartphone screen output at a given moment in time."], ["QWERTY", "Denoting a standard layout of keys on a keyboard for typing, in which the leftmost keys of the top lettered row are Q-W-E-R-T-Y."], ["finder", "One who finds or discovers something."], ["podcast", "An audio programme produced on a regular basis, delivered over the Internet in a compressed digital format and designed for playback on computers or portable digital audio players, such as the iPod."], ["hypertext", "Digital text in which the reader may navigate related information through embedded hyperlinks."], ["real-time", "Communicated as the events being responded to occur; communicated or proceeding without much delay (compare instantaneous, synchronous )"], ["wiki", "A collaborative website which can be directly edited merely by using a web browser, often by anyone with access to it."], ["browser", "A person or animal who browses."], ["piracy", "Robbery at sea, a violation of international law; taking a ship away from the control of those who are legally entitled to it."], ["macro", "Very large in scope or scale."], ["restore", "The act of recovering data or a system from a backup."], ["delete", "A key that may be pressed to delete something (such as text or files) from a computer."], ["data mining", "A technique for searching large-scale databases for patterns; used mainly to find previously unknown correlations between variables that may be commercially useful."], ["search engine", "An application that searches for, and retrieves, data based on some criteria, especially one that searches the Internet for documents containing specified words."], ["binary", "A thing which can have only (one or the other of) two values."], ["protocol", "The minutes, or official record, of a negotiation or transaction; especially a document drawn up officially which forms the legal basis for subsequent agreements based on it."], ["flash drive", "A small electronic device used to store digital data, more portable and robust than a hard drive."], ["password", "A word used to gain admittance or to gain access to information; watchword."], ["page", "One of the many pieces of paper bound together within a book or similar document."], ["motherboard", "The primary circuit board of a personal computer, containing the circuitry for the central processing unit, keyboard, mouse and monitor, together with slots for other devices."], ["freeware", "Complete and functional software that does not require payment or other compensation (such as nags or advertising) for its use. Freeware may be a proprietary license with no access to the source code."], ["option", "One of a set of choices that can be made."], ["junk mail", "Any mail or letters that are not welcome or solicited and typically sent in bulk; especially mail of a commercial nature such as advertising circulars and form letters."], ["log out", "No definition!"], ["keyboard", "(etc.) A set of keys used to operate a typewriter, computer etc."], ["window", "The inedible parts of a grain-producing plant."], ["shift key", "No definition!"], ["compress", "To make smaller; to press or squeeze together, or to make something occupy a smaller space or volume."], ["privacy", "The state of being secluded from the presence, sight, or knowledge of others."], ["disk", "A thin, flat, circular plate or similar object."], ["resolution", "A strong will, determination."], ["Internet", "Any set of computer networks that communicate using the Internet Protocol. (An intranet.)"], ["paste", "A soft moist mixture, in particular:"], ["client", "A customer, a buyer or receiver of goods or services."], ["spam", "(rarely countable) Unsolicited bulk electronic messages."], ["blogger", "A contributor to a blog (from weblog) or online journal."], ["typeface", "The particular design of some type, font, or a font family."], ["desktop", "The top surface of a desk."], ["graphics", "The making of architectural or design drawings."], ["virtual", "A virtual member function of a class."], ["spammer", "Someone who sends spam."], ["folder", "An organizer that papers are kept in, usually with an index tab, to be stored as a single unit in a filing cabinet."], ["development", "The process of developing; growth, directed change."], ["application", "The act of applying or laying on, in a literal sense"], ["flash", "A device that produces a short flash of light to help illuminate a scene, mostly for night-time or indoors photography."], ["screen", "A physical divider intended to block an area from view, or provide shelter from something dangerous."], ["plug-in", "Anything that plugs into something."], ["worm", "A generally tubular invertebrate of the annelid phylum; an earthworm."], ["notebook computer", "No definition!"], ["bitmap", "A series of bits that represents a rasterized graphic image, each pixel being represented as a group of bits."], ["scroll bar", "A graphical widget in the form of a horizontal or vertical bar, on the edges of a personal computer screen, that is used to move scrollable text or images."], ["backup", "A reserve or substitute."], ["dashboard", "A panel under the windscreen of a motor car or aircraft, containing indicator dials, compartments, and sometimes controls."], ["email", "A system for transferring messages from one computer to another, usually through a network."], ["trash", "Useless things to be discarded; rubbish; refuse."], ["logic", "A method of human thought that involves thinking in a linear, step-by-step manner about how a problem can be solved. Logic is the basis of many principles including the scientific method."], ["joystick", "A mechanical device consisting of a handgrip mounted on a base or pedestal and typically having one or more buttons, used to control an aircraft, computer or other equipment."], ["bite", "The act of biting."], ["Unix", "Any Unix-like operating system, including Unix."], ["hacker", "One who is expert at programming and solving problems with a computer."], ["platform", "A raised stage from which speeches are made and on which musical and other performances are made."], ["interface", "The point of interconnection or contact between entities."], ["byte", "A short sequence of bits (binary digits) that can be operated on as a unit by a computer; the smallest usable machine word."], ["network", "A fabric or structure of fibrous elements attached to each other at regular intervals."], ["format", "The layout of a publication or document."], ["surf", "Waves that break on an ocean shoreline."], ["icon", "An image, symbol, picture, or other representation usually as an object of religious devotion."], ["supercomputer", "Any computer that has a far greater processing power than others of its day; typically they use more than one core and are housed in large clean rooms with high air flow to permit cooling. Typical uses are weather forecasting, nuclear simulations and animations."], ["broadband", "A wide band of electromagnetic frequencies"], ["clip art", "A set of images, distributed as files with other software, that may be copied and pasted into documents or other files."], ["encrypt", "To conceal information by means of a code or cipher."], ["integer", "A number that is not a fraction; an element of the infinite and numerable set {..., -3, -2, -1, 0, 1, 2, 3, ...}."], ["domain", "A geographic area owned or controlled by a single person or organization."], ["keyword", "Any word used as the key to a code."], ["offline", "To take (a system, etc.) offline; to demote from an active or online state."], ["emoticon", "A graphical representation of a particular emotion of the writer, used especially in SMS, email, or other electronic communication."], ["website", "A collection of interlinked web pages on the World Wide Web that are typically accessible from the same base URL and reside on the same server."], ["exabyte", "A unit of storage capacity, 1,000,000,000,000,000,000 (1018) bytes"], ["toolbar", "A row of buttons, usually marked with icons, used to activate the functions of an application or operating system"], ["media", "The middle layer of the wall of a blood vessel or lymph vessel which is composed of connective and muscular tissue."], ["cache", "A store of things that may be required in the future, which can be retrieved rapidly, protected or hidden in some way."], ["hyperlink", "Some text or a graphic in an electronic document that can be activated to display another document or trigger an action."], ["debug", "The action, or a session, of reviewing source code to find and eliminate errors."], ["cloud computing", "Computing services provided over the Internet (or \"cloud\"), whereby shared resources, software, and information are provided to computers and other devices on demand."], ["cookie", "A small, flat, baked good which is either crisp or soft but firm."], ["online", "To bring (a system, etc.) online; to promote to an active or running state."], ["virtual memory", "Memory that appears to be RAM but is being simulated (by a process called paging) on a hard disk; allows a computer to operate as if it had more memory than it actually does, but with some loss of performance"], ["user", "One who uses or makes use of something, a consumer/client or an express or implied licensee (free user) or a trespasser."], ["security", "The condition of not being threatened, especially physically, psychologically, emotionally, or financially."], ["analog", "Something that bears an analogy to something else"], ["node", "A knot, knob, protuberance or swelling."], ["runtime", "The stage during which a program is executing."], ["social networking", "The interaction between a group of people who share a common interest."], ["workstation", "A desktop computer, normally more powerful than a normal PC and often dedicated to a specific task, such as graphics"], ["program", "A set of structured activities."], ["iteration", "Recital or performance a second time; repetition."], ["teminal", "No definition!"], ["clip board", "No definition!"], ["firmware", "Something in between hardware and software. Like software, it is created from source code, but it is closely tied to the hardware it runs on."], ["file", "A collection of papers collated and archived together."], ["storage", "The act of storing goods; the state of being stored."], ["wireless", "The medium of radio communication."], ["bookmark", "A strip of material used to mark a place in a book."], ["utility", "The state or condition of being useful; usefulness."], ["array", "Clothing and ornamentation."], ["shareware", "A type of software that is distributed without payment but is limited in any combination of functionality, availability, or convenience."], ["shift", "A modifier key whose main function is shifting between two or more functions of any of certain other keys (usually by pressing Shift and the other button simultaneously)."], ["memory", "The ability of the brain to record information or impressions with the facility of recalling them later at will."], ["mainframe", "A large, powerful computer able to manage very many simultaneous tasks and communicate with very many connected terminals; used by large, complex organizations (such as banks and supermarkets) where continuously sustained operation is vital"], ["scanner", "A device which scans documents in order to convert them to a digital medium."], ["portal", "An entrance, entry point, or means of entry."], ["configure", "To set up or arrange something in such a way that it is ready for operation for a particular purpose, or to someone's particular liking"], ["bandwidth", "The width, usually measured in hertz, of a frequency band."], ["process", "A series of events which produce a result (the product)."], ["user interface", "The visual part of a software application that a user sees and interacts with."], ["widget", "A placeholder name for an unnamed, unspecified, or hypothetical manufactured good or product."], ["virus", "A submicroscopic, non-cellular structure consisting of a core of DNA or RNA surrounded by a protein coat, that requires a living host cell to replicate, and often causes disease in the host organism."], ["lurking", "To remain concealed in order to ambush."], ["root", "The part of a plant, generally underground, that anchors and supports the plant body, absorbs and stores water and nutrients, and in some plants is able to perform vegetative reproduction."], ["server", "A program that provides services to other programs or devices, either in the same computer or over a computer network."], ["host", "One which receives or entertains a guest, socially, commercially, or officially."], ["webmaster", "A person responsible for designing, developing, and maintaining a website or websites."], ["laser printer", "A computer printer that uses a laser beam to produce an image on a rotating drum before transferring it to the paper."], ["username", "A person's identification on an individual computer system."], ["cybercrime", "Crime committed using computer networks."], ["link", "Some text or a graphic in an electronic document that can be activated to display another document or trigger an action."], ["snapshot", "A photograph, especially one taken quickly or in a moment of opportunity."], ["laptop", "A laptop computer."], ["blog", "A website that allows users to reflect, share opinions, and discuss various topics in the form of an online journal, sometimes letting readers comment on their posts. Most blogs are written in a slightly informal tone (personal journals, news, businesses, etc.)"], ["command", "An order to do something."], ["compile", "An act of compiling code."], ["CD-ROM", "No definition!"], ["terabyte", "One trillion (1012, or 1,000,000,000,000) bytes. SI symbol: TB."], ["scan", "Close investigation."], ["dot matrix", "A two-dimensional array or pattern of dots used (for example, by a display device or a printer) to represent alphanumeric characters and pictures."], ["World Wide Web", "No definition!"], ["captcha", "A computerized test requiring the human user to perform a task deemed to be difficult to automate, such as entering a displayed series of distorted characters or describing images, to demonstrate that he/she is a human and not a computer program."], ["malware", "Software which has been designed to operate in a malicious, undesirable manner."], ["print", "Books and other material created by printing presses, considered collectively or as a medium."], ["monitor", "Someone who watches over something; a person in charge of something or someone."], ["scroll", "A roll of paper or parchment; a writing formed into a roll."], ["text editor", "A program which allows a user to edit the contents of a text file, usually in an interactive way with immediate visual feedback. Compare word processor."], ["phishing", "To engage in phishing."], ["printer", "One who makes prints."], ["script", "A writing; a written document."], ["pirate", "A criminal who plunders at sea; commonly attacking merchant vessels, though often pillaging port towns."], ["cyberspace", "A world of information accessed through the Internet."], ["domain name", "A unique, case-insensitive, name, consisting of a string made up of alphanumeric characters and dashes separated by periods, that the Domain Name System maps to IP numbers and other information."], ["ROM (read only memory)", "No definition!"], ["software", "Encoded computer instructions, usually modifiable (unless stored in some form of unalterable memory such as ROM)."], ["algorithm", "A collection of ordered steps that solve a mathematical problem. A precise step-by-step plan for a computational procedure that possibly begins with an input value and yields an output value in a finite number of steps."], ["firewall", "A fireproof barrier used to prevent the spread of fire between or through buildings, structures, electrical substation transformers, or within an aircraft or vehicle."], ["open source", "No definition!"], ["undo", "An operation that reverses a previous action."], ["decompress", "To relieve the pressure or compression on something."], ["multimedia", "The combined use of sound, video, and text to present an idea."], ["document", "An original or official paper used as the basis, proof, or support of anything else, including any writing, book, or other instrument conveying information pertinent to such proof or support."], ["floppy disk", "A removable disk used for storing digital data, measuring between 2 and 8 inches diagonally and storing between 80 KB and 240 MB."], ["Java", "A blend of coffee imported from the island of Java."], ["output", "Production; quantity produced, created, or completed."], ["download", "A file transfer to the local computer."], ["hack", "A tool for chopping."], ["table", "Furniture with a top surface to accommodate a variety of uses."], ["Windows", "The inedible parts of a grain-producing plant."], ["encryption", "The process of obscuring information to make it unreadable without special knowledge, key files, or passwords."], ["DVD (digital versatile disc)", "No definition!"], ["login", "A combination of a user's identification and password used to enter a computer, program, network, etc."], ["queue", "An animal's tail."], ["Trojan horse", "No definition!"], ["status bar", "An information area typically found at the bottom of windows in a graphical user interface."], ["word processor", "A device similar to a simple computer, designed for word processing."], ["template", "A physical object whose shape is used as a guide to make other objects."], ["caps lock", "No definition!"], ["thread", "A long, thin and flexible form of material, generally with a round cross-section, used in sewing, weaving or in the construction of string."], ["gigabyte", "(SI) 109, one billion (1,000,000,000) bytes. SI symbol: GB"], ["reboot", "An instance of rebooting."], ["frame", "The structural elements of a building or other constructed object."], ["inbox", "A container in which papers to be dealt with are put."], ["copy", "The result of copying; an identical duplicate of an original."], ["upload", "Such a file transfer."], ["computer", "A person employed to perform computations; one who computes."], ["path", "A trail for the use of, or worn by, pedestrians."], ["data", "(plural: data) A measurement of something on a scale understood by both the recorder (a person or device) and the reader (another person or device). The scale is arbitrarily defined, such as from 1 to 10 by ones, 1 to 100 by 0.1, or simply true or false, on or off, yes, no, or maybe, etc."], ["router", "Someone who routes or directs items from one location to another."], ["digital", "A digital option."], ["flowchart", "A schematic representation of how the different stages in a process are interconnected."], ["Linux", "Any unix-like operating system distro that uses the Linux kernel."], ["version", "A specific form or variation of something."], ["spreadsheet", "A sheet of paper, marked with a grid, in which financial data is recorded and totals calculated manually."], ["home page", "The main or first page of a web site or set of hyperlinked documents."], ["web host", "No definition!"], ["boot", "A heavy shoe that covers part of the leg."], ["computer program", "No definition!"], ["operating system", "Software that controls the allocation and usage of hardware resources such as memory, CPU time, disk space, and input and output devices."], ["mirror", "A smooth surface, usually made of glass with reflective material painted on the underside, that reflects light so as to give an image of what is in front of it."], ["kernel", "The core, center, or essence of an object or system."], ["enter", "The \"Enter\" key on a computer keyboard."], ["database", "(general) A collection of (usually) organized information in a regular structure, usually but not necessarily in a machine-readable format accessible by a computer."], ["drag", "Resistance of the air (or some other fluid) to something moving through it."], ["save", "In various sports, a block that prevents an opponent from scoring."], ["syntax", "A set of rules that govern how words are combined to form phrases and sentences."], ["dynamic", "A characteristic or manner of an interaction; a behavior."], ["spyware", "Programs that surreptitiously monitor and report the actions of a computer user."], ["shell", "A hard external covering of an animal."], ["font", "A receptacle in a church for holy water, especially one used in baptism."], ["programmer", "One who writes computer programs; a software developer."], ["modem", "A device that encodes digital computer signals into analog/analogue telephone signals and vice versa and allows computers to communicate over a phone line."], ["IP address", "No definition!"], ["hardware", "Fixtures, equipment, tools and devices used for general-purpose construction and repair of a structure or object. Also such equipment as sold as stock by a store of the same name, e.g. hardware store."], ["mouse", "Any small rodent of the genus Mus."], ["Macintosh", "A raincoat."], ["buffer", "Of the color of buff leather, a brownish yellow."]]